JasperWong/LowCarbonFan_CC3200_Net/exosite_cloud_demo_for_cc3200/main.c
//*****************************************************************************
// main.c
//
// Reference code to demonstrate AP Provisioning
//
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/ 
// 
// 
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//    Redistributions of source code must retain the above copyright 
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the 
//    documentation and/or other materials provided with the   
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

//****************************************************************************
//
//! \addtogroup ap_provisioning
//! @{
//
//****************************************************************************

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "datatypes.h"
#include "socket.h"
#include "simplelink.h"
#include "hw_types.h"
#include "hw_ints.h"
#include "hw_memmap.h"
#include "hw_common_reg.h"
#include "rom.h"
#include "rom_map.h"
#include "interrupt.h"
#include "gpio.h"
#include "pin.h"
#include "utils.h"
#include "prcm.h"
#include "pinmux.h"
#include "timer.h"
#include "uart_if.h"
#include "i2c_if.h"
#include "gpio_if.h"
#include "timer_if.h"
#include "button_if.h"
#include "tmp006drv.h"
#include "bma222drv.h"

#define DBG_PRINT                (x)
#define APP_TASK_PRIORITY        (1)
#define SPAWN_TASK_PRIORITY      (4)
#define OSI_STACK_SIZE		     (2048)
#define CONNECTION_TIMEOUT_COUNT (5000) /* 5sec */
#define TOKEN_ARRAY_SIZE         16
#define STRING_TOKEN_SIZE        10
#define AP_SSID_LEN_MAX          33
#define SL_STOP_TIMEOUT          30
#define TASK_PRIORITY            (1)
#define TIMER_INTERVAL_RELOAD   40035 /* =(255*157) */
#define DUTYCYCLE_GRANULARITY   157
//****************************************************************************
//                     GLOBAL VARIABLES                                    
//****************************************************************************
#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif

unsigned char g_ucIpObtained = 0, g_ucProfileAdded = 1, g_ucConnectionStatus = 0;
unsigned char g_ucConnectedToConfAP = 0, g_ucProvisioningDone = 0;
unsigned int g_uiConnectTimeoutCnt =0, g_uiIpAddress = 0;
unsigned char g_ucPriority;
char g_cWlanSSID[AP_SSID_LEN_MAX];
char g_cWlanSecurityKey[50];
SlSecParams_t g_SecParams;
Sl_WlanNetworkEntry_t g_NetEntries[20];
char g_token_get [TOKEN_ARRAY_SIZE][STRING_TOKEN_SIZE] = {"__SL_G_US0","__SL_G_US1",
                    "__SL_G_US2", "__SL_G_US3", "__SL_G_US4", "__SL_G_US5", "__SL_G_US6",
                    "__SL_G_US7", "__SL_G_US8", "__SL_G_US9", "__SL_G_USa", "__SL_G_USb",
                    "__SL_G_USc", "__SL_G_USd", "__SL_G_USe", "__SL_G_USf"};

OsiTaskHandle g_ProvisioningAP;

// externs
extern void cloud_demo( void );
extern void Demo_Tick(void);
extern void SW2_Pressed(void);
extern void SW3_Pressed(void);
//extern volatile int sw2_button_on;



//***************************************************************************** 
// Callback function for FreeRTOS 
//*****************************************************************************
#ifdef USE_FREERTOS
void vApplicationStackOverflowHook( OsiTaskHandle pxTask, signed char *pcTaskName )
{
    while(1)
    {
      // Infinite loop;
    }
}

void vApplicationTickHook( void )
{

}

void vApplicationIdleHook( void )
{
      
}

void vAssertCalled( const char *pcFile, unsigned long ulLine )
{
    while(1)
    {
       
    }
}

#endif

//****************************************************************************
//
//! \brief This function handles WLAN events
//!
//! \param[in]      pSlWlanEvent is the event passed to the handler
//!
//! \return	    None
//
//****************************************************************************
void sl_WlanEvtHdlr(SlWlanEvent_t *pSlWlanEvent)
{
    switch(((SlWlanEvent_t*)pSlWlanEvent)->Event)
    {
    case SL_WLAN_CONNECT_EVENT:
           g_ucConnectionStatus = 1;
           break;
        case SL_WLAN_DISCONNECT_EVENT:
           g_ucConnectionStatus = 0;
           break;
        default:
          break;
    }
}

//****************************************************************************
//
//! \brief This function handles events for IP address acquisition via DHCP
//!		   indication
//!
//! \param[in]  	pNetAppEvent is the event passed to the handler
//!
//! \return	                	None
//
//****************************************************************************
void sl_NetAppEvtHdlr(SlNetAppEvent_t *pNetAppEvent)
{
    switch( pNetAppEvent->Event )
    {
        case SL_NETAPP_IPV4_ACQUIRED:
            g_ucIpObtained = 1;
            g_uiIpAddress = pNetAppEvent->EventData.ipAcquiredV4.ip;
            break;
        default:
            break;
    }
}

//*****************************************************************************
//
//! The interrupt handler for the 100ms interrupt.
//!
//! \param  None
//!
//! \return none
//
//*****************************************************************************
void
TimerBaseIntHandler(void)
{
  //
  // Clear the timer interrupt.
  //
  Timer_IF_InterruptClear(TIMERA0_BASE);
  Demo_Tick();
}

//*****************************************************************************
//
//! The interrupt handler for the 100ms interrupt.
//!
//! \param  None
//!
//! \return none
//
//*****************************************************************************
void
TimerA1IntHandler(void)
{
  //
  // Clear the timer interrupt.
  //
  Timer_IF_InterruptClear(TIMERA1_BASE);
  if (GPIOPinRead(GPIOA1_BASE,GPIO_PIN_5)) //sw3
  {
    SW3_Pressed();
  }
  if (GPIOPinRead(GPIOA2_BASE,GPIO_PIN_6)) //sw2
  {
    SW2_Pressed();
  }
}

//*****************************************************************************
//
//! DeInitDriver
//! The function de-initializes a CC3200 device
//!  
//! \param  None
//!  
//! \return none
//
//*****************************************************************************
void
DeInitDriver(void)
{
    //
    // Disconnect from the AP
    //
    sl_WlanDisconnect();
    //
    // Stop the simplelink host
    //
    sl_Stop(SL_STOP_TIMEOUT);
}

void
DeInitDriverAP(void)
{
    //
    // Stop the simplelink host
    //
    sl_Stop(SL_STOP_TIMEOUT);

