JasperWong/LowCarbonFan_CC3200_Net/exosite_cloud_demo_for_cc3200/main.c
}
//*****************************************************************************
//
//! initDriver
//! The function initializes a CC3200 device and triggers it to start operation
//!  
//! \param  None
//!  
//! \return none
//
//*****************************************************************************
int
InitDriver(void)
{
    //
    // Start the simplelink host
    //
    return sl_Start(NULL,NULL,NULL);

}

void WlanConnect()
{
    //Add Profile
    sl_WlanProfileAdd(g_cWlanSSID, strlen((char*)g_cWlanSSID), 0, &g_SecParams, 0,g_ucPriority,0);

    //Connecting to the Access point
    sl_WlanConnect(g_cWlanSSID, strlen((char*)g_cWlanSSID), 0, &g_SecParams, 0);

    //waiting for the device to connect to the AP and obtain ip address
    while (g_uiConnectTimeoutCnt<CONNECTION_TIMEOUT_COUNT && ((g_ucConnectionStatus == 0) || (g_ucIpObtained == 0)))
    {
        osi_Sleep(1); //Sleep 1 millisecond
        g_uiConnectTimeoutCnt++;
    }

    g_uiConnectTimeoutCnt = 0;

}


//****************************************************************************
//
//! Task function implements the ProvisioningAP functionality
//!
//! \param none
//! 
//! This function  
//!    1. Starts Device in STA Mode
//!    2. Scans and Stores all the AP
//!    3. Switch to AP Mode and Wait for AP Configuration from Browser
//!    4. Switch to STA Mode and Connect to Configured AP
//!
//! \return None.
//
//****************************************************************************
void ProvisioningAP(void* pTaskParams)
{

    int iDeviceMode = 0, auto_connect_mode = 0;
    char message[100];
    unsigned long intervalInSeconds = 10;
    char force_ap_mode = 0;

    int Index,i;

    // Check SW3, if pressed force AP mode.
    if (GPIOPinRead(GPIOA1_BASE,GPIO_PIN_5)) //sw3
    {
      Report("Forcing into AP Mode\r\n");
      force_ap_mode = 1;
    }

    //
    // Start the driver
    //
    iDeviceMode = InitDriver();
    
    if (iDeviceMode == ROLE_AP)
    {
        //Device in AP Mode, Wait for Initialization to Complete
        while (g_ucIpObtained == 0)
        {
            UtilsDelay(100); 
        }
    }
    
    sl_WlanSetMode(ROLE_STA);
    

    if (iDeviceMode == ROLE_AP)
    	DeInitDriverAP();
    else
    	DeInitDriver();
    
    g_ucIpObtained = 0;
    g_ucConnectionStatus = 0;
    
    //UtilsDelay(10000000); // wait for scan to append msec
    InitDriver();
    
  
    while(!g_ucProvisioningDone)
    {
        // Hardcode SSID
    	//char *ssid = "exosite16";
    	//char *key = "ex0p@ssw0rd";
    	//memcpy(g_cWlanSSID, ssid, strlen(ssid));
    	//memcpy(g_cWlanSecurityKey, key, strlen(key));
    	//g_SecParams.Type = SL_SEC_TYPE_WPA;
        //g_SecParams.Key = g_cWlanSecurityKey;
        //g_SecParams.KeyLen = strlen(g_cWlanSecurityKey);
    	//g_ucProvisioningDone = 1;
        //Report("Default SSID : %s\r\n", g_cWlanSSID);
        //Report("Default WiFi Key : %s\r\n", g_cWlanSecurityKey);
        if ((g_cWlanSSID[0] == 0 || g_cWlanSSID[0] == NULL) ||
             ((g_SecParams.Type != SL_SEC_TYPE_OPEN) && (g_cWlanSecurityKey[0] == 0 || g_cWlanSecurityKey[0] == NULL)))
        {
			 //Scan AP in STA mode
			Report("Scan AP in STA mode\r\n");
			sl_WlanPolicySet(SL_POLICY_SCAN,SL_SCAN_POLICY_EN(1),
							 (unsigned char *)&intervalInSeconds,sizeof(intervalInSeconds));

			// wait for scan to complete
			UtilsDelay(20000000);

			//Get Scan Result
			Index = sl_WlanGetNetworkList(0,20,&g_NetEntries[0]);

			for(i=0; i< Index; i++)
			{
				 snprintf(message, 60, "%d) SSID %s\n\r",i,g_NetEntries[i].ssid);
				 Report("%d) SSID %s\n\r",i,g_NetEntries[i].ssid);
			}
			Report("Switch back to AP Mode\r\n");
			//Switch to AP Mode
			sl_WlanSetMode(ROLE_AP);
	        DeInitDriver();
	        g_ucIpObtained = 0;
	        g_ucConnectionStatus = 0;


	        //Initialize the SLHost Driver
	        InitDriver();

	        char ssid[50];
	        int ssidlen = 0;
	        unsigned char mac[12];
	        SlSecParams_t pSecParams;
	        SlGetSecParamsExt_t pSecExtParams;
	        unsigned long pPriority = 0;
	        for (i = 0; i < 8; i++)
	        {
	        	if (sl_WlanProfileGet(i, ssid, &ssidlen, mac, &pSecParams, &pSecExtParams, &pPriority) >= 0)
	        		break;
	        }
	        ssid[ssidlen] = 0;
            if (ssid != NULL && ssidlen > 0 && !force_ap_mode)
            {
    	        Report("Profile SSID:%s\r\n", ssid);
    	        g_ucIpObtained = 0;
    	        g_ucConnectionStatus = 0;
            	Report("Auto Connect..\r\n");
            	sl_WlanSetMode(ROLE_STA);
                sl_Stop(SL_STOP_TIMEOUT);
                iDeviceMode =  sl_Start(NULL,NULL,NULL);
                Report("STA mode setup ready.\r\n");
                if (iDeviceMode == ROLE_STA)
                {
                  Report("Work in STA mode.\r\n");
                  auto_connect_mode = 1;
                }
                else
                  Report("STA mode switch failure.\r\n");
            }

	        //Wait for Ip Acquired Event in AP Mode
	        while (g_ucIpObtained == 0)
	        {
	            UtilsDelay(100);
	        }

	        //
	        // Wait for AP Configuraiton, Open Browser and Configure AP
	        //
	        if (auto_connect_mode == 0)
	        {
	          while (g_ucProfileAdded && !g_ucProvisioningDone)
	          {
	            UtilsDelay(100);
	          }
	        }
        }

        g_ucProfileAdded = 1;
        //if (g_ucProvisioningDone && !auto_connect_mode)
        if (!auto_connect_mode)
        {
          Report("Switch to STA Mode\r\n");
          //Switch to STA Mode
          sl_WlanSetMode(ROLE_STA);
          
          //AP Configured, Restart in STA Mode
          DeInitDriverAP();
           
          g_ucIpObtained = 0;
          g_ucConnectionStatus = 0;

          //UtilsDelay(10000000);
          InitDriver();
          Report("Connect to SSID:%s\r\n", g_cWlanSSID);
          // Connect to the Configured Access Point
          WlanConnect();
        }
        else if (auto_connect_mode)
        {
        	Report("Wait to auto connect..\r\n");
        	while(!g_ucConnectionStatus && !g_ucIpObtained)
        	{
        	  UtilsDelay(100);
        	}
        }
        g_ucConnectedToConfAP = g_ucConnectionStatus;

        Report("cloud_demo start X2 \r\n");

        cloud_demo();

        sl_WlanDisconnect();
    }

    Report("End of Program\r\n");
}

//*****************************************************************************
//
//! This function gets triggered when HTTP Server receives Application
//! defined GET and POST HTTP Tokens.
//!
//! \param pSlHttpServerEvent Pointer indicating http server event
//! \param pSlHttpServerResponse Pointer indicating http server response
//!
//! \return None
//!
//*****************************************************************************
void sl_HttpServerCallback(SlHttpServerEvent_t *pSlHttpServerEvent, SlHttpServerResponse_t *pSlHttpServerResponse)
{
    int i = 0;
    switch (pSlHttpServerEvent->Event)
    {
        case SL_NETAPP_HTTPGETTOKENVALUE:
        {
            if (0== memcmp (pSlHttpServerEvent->EventData.httpTokenName.data,
                            g_token_get [0],pSlHttpServerEvent->EventData.httpTokenName.len))
            {
                if(g_ucConnectedToConfAP == 1)
                {
                    memcpy (pSlHttpServerResponse->ResponseData.token_value.data, "TRUE",strlen("TRUE")); // Important - Connection Status
                    pSlHttpServerResponse->ResponseData.token_value.len = strlen("TRUE");
                }
                else
                {
                    memcpy (pSlHttpServerResponse->ResponseData.token_value.data, "FALSE",strlen("FALSE")); // Important - Connection Status
                    pSlHttpServerResponse->ResponseData.token_value.len = strlen("FALSE");
                }
            }
           for (i = 0; i < TOKEN_ARRAY_SIZE - 1; i++)
           {
            if (0== memcmp (pSlHttpServerEvent->EventData.httpTokenName.data,
                            g_token_get [i + 1],pSlHttpServerEvent->EventData.httpTokenName.len))
            {
                memcpy (pSlHttpServerResponse->ResponseData.token_value.data,
                        g_NetEntries[i].ssid,g_NetEntries[i].ssid_len); // Important - Token value len should be < MAX_TOKEN_VALUE_LEN
                pSlHttpServerResponse->ResponseData.token_value.data[g_NetEntries[i].ssid_len] = 0;
                pSlHttpServerResponse->ResponseData.token_value.len = g_NetEntries[i].ssid_len;
            }
           }
      }
              break;

      case SL_NETAPP_HTTPPOSTTOKENVALUE:
      {

        if ((0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_name.data,
                          "__SL_P_USC", pSlHttpServerEvent->EventData.httpPostData.token_name.len)) &&
            (0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_value.data,
                          "Add", pSlHttpServerEvent->EventData.httpPostData.token_value.len)))
        {
            g_ucProfileAdded = 0;

