JasperWong/LowCarbonFan_CC3200_Net/exosite_cloud_demo_for_cc3200/main.c
        }
        if (0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_name.data,
                         "__SL_P_USD", pSlHttpServerEvent->EventData.httpPostData.token_name.len))
        {
            memcpy (g_cWlanSSID,  pSlHttpServerEvent->EventData.httpPostData.token_value.data,
                    pSlHttpServerEvent->EventData.httpPostData.token_value.len);
            g_cWlanSSID[pSlHttpServerEvent->EventData.httpPostData.token_value.len] = 0;
        }

        if (0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_name.data,
                         "__SL_P_USE", pSlHttpServerEvent->EventData.httpPostData.token_name.len))
        {

            if (pSlHttpServerEvent->EventData.httpPostData.token_value.data[0] == '0')
            {
                g_SecParams.Type =  SL_SEC_TYPE_OPEN;//SL_SEC_TYPE_OPEN

            }
            else if (pSlHttpServerEvent->EventData.httpPostData.token_value.data[0] == '1')
            {
                g_SecParams.Type =  SL_SEC_TYPE_WEP;//SL_SEC_TYPE_WEP

            }
            else if (pSlHttpServerEvent->EventData.httpPostData.token_value.data[0] == '2')
            {
                g_SecParams.Type =  SL_SEC_TYPE_WPA;//SL_SEC_TYPE_WPA

            }
            else 
            {
                g_SecParams.Type =  SL_SEC_TYPE_OPEN;//SL_SEC_TYPE_OPEN
            }
        }
        if (0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_name.data,
                         "__SL_P_USF", pSlHttpServerEvent->EventData.httpPostData.token_name.len))
        {
            memcpy (g_cWlanSecurityKey,pSlHttpServerEvent->EventData.httpPostData.token_value.data,
                    pSlHttpServerEvent->EventData.httpPostData.token_value.len);
            g_cWlanSecurityKey[pSlHttpServerEvent->EventData.httpPostData.token_value.len] = 0;
            g_SecParams.Key = g_cWlanSecurityKey;
            g_SecParams.KeyLen = pSlHttpServerEvent->EventData.httpPostData.token_value.len;
        }
        if (0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_name.data, "__SL_P_USG",
                         pSlHttpServerEvent->EventData.httpPostData.token_name.len))
        {
           g_ucPriority = pSlHttpServerEvent->EventData.httpPostData.token_value.data[0] - 48;
        }
        if (0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_name.data,
                         "__SL_P_US0", pSlHttpServerEvent->EventData.httpPostData.token_name.len))
        {
            g_ucProvisioningDone = 1;
        }
      }
          break;
      default:
          break;
    }
}


//****************************************************************************
//
//! Setup the timer in PWM mode
//!
//! \param ulBase is the base address of the timer to be configured
//! \param ulTimer is the timer to be setup (TIMER_A or  TIMER_B)
//! \param ulConfig is the timer configuration setting
//! \param ucInvert is to select the inversion of the output
//!
//! This function
//!    1. The specified timer is setup to operate as PWM
//!
//! \return None.
//
//****************************************************************************
void SetupTimerPWMMode(unsigned long ulBase, unsigned long ulTimer,
                       unsigned long ulConfig, unsigned char ucInvert)
{
    //
    // Set GPT - Configured Timer in PWM mode.
    //
    MAP_TimerConfigure(ulBase,ulConfig);
    MAP_TimerPrescaleSet(ulBase,ulTimer,0);

    //
    // Inverting the timer output if required
    //
    MAP_TimerControlLevel(ulBase,ulTimer,ucInvert);

    //
    // Load value set to ~0.5 ms time period
    //
    MAP_TimerLoadSet(ulBase,ulTimer,TIMER_INTERVAL_RELOAD);

    //
    // Match value set so as to output level 0
    //
    MAP_TimerMatchSet(ulBase,ulTimer,TIMER_INTERVAL_RELOAD);

}

//****************************************************************************
//
//! Sets up the identified timers as PWM to drive the peripherals
//!
//! \param none
//!
//! This function sets up the folowing
//!    1. TIMERA2 (TIMER B) as RED of RGB light
//!    2. TIMERA3 (TIMER B) as YELLOW of RGB light
//!    3. TIMERA3 (TIMER A) as GREEN of RGB light
//!
//! \return None.
//
//****************************************************************************
void InitPWMModules()
{
    //
    // Initialization of timers to generate PWM output
    //
    MAP_PRCMPeripheralClkEnable(PRCM_TIMERA2, PRCM_RUN_MODE_CLK);
    MAP_PRCMPeripheralClkEnable(PRCM_TIMERA3, PRCM_RUN_MODE_CLK);

    //
    // TIMERA2 (TIMER B) as RED of RGB light. GPIO 9 --> PWM_5
    //
    SetupTimerPWMMode(TIMERA2_BASE, TIMER_B,
            (TIMER_CFG_SPLIT_PAIR | TIMER_CFG_B_PWM), 1);
//    //
//    // TIMERA3 (TIMER B) as YELLOW of RGB light. GPIO 10 --> PWM_6
//    //
//    SetupTimerPWMMode(TIMERA3_BASE, TIMER_A,
//            (TIMER_CFG_SPLIT_PAIR | TIMER_CFG_A_PWM | TIMER_CFG_B_PWM), 1);
//    //
//    // TIMERA3 (TIMER A) as GREEN of RGB light. GPIO 11 --> PWM_7
//    //
//    SetupTimerPWMMode(TIMERA3_BASE, TIMER_B,
//            (TIMER_CFG_SPLIT_PAIR | TIMER_CFG_A_PWM | TIMER_CFG_B_PWM), 1);

    MAP_TimerEnable(TIMERA2_BASE,TIMER_B);
//    MAP_TimerEnable(TIMERA3_BASE,TIMER_A);
//    MAP_TimerEnable(TIMERA3_BASE,TIMER_B);
}

//****************************************************************************
//
//! Update the dutycycle of the PWM timer
//!
//! \param ulBase is the base address of the timer to be configured
//! \param ulTimer is the timer to be setup (TIMER_A or  TIMER_B)
//! \param ucLevel translates to duty cycle settings (0:255)
//!
//! This function
//!    1. The specified timer is setup to operate as PWM
//!
//! \return None.
//
//****************************************************************************
void UpdateDutyCycle(unsigned long ulBase, unsigned long ulTimer,
                     unsigned char ucLevel)
{
    //
    // Match value is updated to reflect the new dutycycle settings
    //
    MAP_TimerMatchSet(ulBase,ulTimer,(ucLevel*DUTYCYCLE_GRANULARITY));
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
  //
  // Set vector table base
  //
//#if defined(ccs)
//    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
//#endif
//#if defined(ewarm)
//    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
//#endif
#endif
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}


//****************************************************************************
//
//! Main function
//!
//! \param none
//! 
//! This function  
//!    1. Invokes the SLHost task
//!    2. Invokes the AP Provisioning Task
//!
//! \return None.
//
//****************************************************************************
void main()
{
    int iLoopCnt;

    //
    // Setup the interrupt vector table
    //
#if defined(ewarm)
    IntVTableBaseSet((unsigned long)&__vector_table);
#endif

    //MCU Initialization
    PRCMCC3200MCUInit();

    IntMasterEnable();
    IntEnable(FAULT_SYSTICK);

    PinMuxConfig();

    InitPWMModules();

    for(iLoopCnt = 125; iLoopCnt >= 10; iLoopCnt--)
    {
        UpdateDutyCycle(TIMERA2_BASE, TIMER_B, iLoopCnt);
        MAP_UtilsDelay(800000);
    }

//    GPIO_IF_LedConfigure(LED1|LED2|LED3);
    GPIO_IF_LedOff(MCU_ALL_LED_IND);

    Timer_IF_Init(PRCM_TIMERA0, TIMERA0_BASE, TIMER_CFG_PERIODIC, TIMER_A, 0);
    Timer_IF_Init(PRCM_TIMERA1, TIMERA1_BASE, TIMER_CFG_PERIODIC, TIMER_A, 0);

    // Setup the interrupts for the timer timeouts.
    Timer_IF_IntSetup(TIMERA0_BASE, TIMER_A, TimerBaseIntHandler);
    Timer_IF_IntSetup(TIMERA1_BASE, TIMER_A, TimerA1IntHandler);

    InitTerm();
    ClearTerm();

    //
    // I2C Init
    //
    I2C_IF_Open(I2C_MASTER_MODE_FST);

    //Init Temprature Sensor
    TMP006DrvOpen();

    //Init Accelerometer Sensor
    BMA222Open();

    // Turn on the timers
    Timer_IF_Start(TIMERA0_BASE, TIMER_A,
                    PERIODIC_TEST_CYCLES * PERIODIC_TEST_LOOPS / 10);
    Timer_IF_Start(TIMERA1_BASE, TIMER_A,
                    PERIODIC_TEST_CYCLES * PERIODIC_TEST_LOOPS / 40);
    //
    // Simplelinkspawntask
    //
    VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);

    osi_TaskCreate(ProvisioningAP, (signed char*)"ProvisioningAP",OSI_STACK_SIZE, NULL, APP_TASK_PRIORITY, &g_ProvisioningAP );

    osi_start();
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
void SimpleLinkSockEventHandler(SlSockEvent_t *pSock)
{
	//
	// This application doesn't work w/ socket - Events are not expected
	//
	switch( pSock->Event )
	{
		case SL_NETAPP_SOCKET_TX_FAILED:
			switch( pSock->EventData.status )
			{
				case SL_ECLOSE:
					/*UART_PRINT("[SOCK ERROR] - close socket (%d) operation "
					"failed to transmit all queued packets\n\n",
					pSock->EventData.sd);*/
					break;
				default:
					/*UART_PRINT("[SOCK ERROR] - TX FAILED : socket %d , reason "
					"(%d) \n\n",
					pSock->EventData.sd, pSock->EventData.status); */
					break;
			}
			break;
		default:
			/*UART_PRINT("[SOCK EVENT] - Unexpected Event [%x0x]\n\n",pSock->Event);*/
			break;
	}
}
